java_web_services/ruby/soapmsgs_getTimeAsString_request.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Body>
    <n1:getTimeAsString xmlns:n1="http://basics.jws.johnragan.org/">
    </n1:getTimeAsString>
  </env:Body>
</env:Envelope>